"use client";
import React from 'react';
import css from './About.module.css';

import Container from '@/components/Container/Container';
import {LangProps} from '../../types/page';


export default function About({ lang }: LangProps) {

  const texts = {
    ru: {
      title: "Блог о путешествиях: куда поехать в отпуск",
      desc: "Узнайте больше о культуре страны, в которой вы так хотели побывать",
      text1: `Путешествия – это не только отдых, но и развитие. Побывав в разных
          странах, вы невольно учите иностранный язык – совершенствуете
          различные навыки, узнаете об особенностях народностей и расширяете
          культурные представления о мире.`,
      text2: `Дневник странника – блог о путешествиях. Часто люди теряются, планируя
          свой отпуск, возникает много вопросов: куда ехать, какой отель
          забронировать, как рассчитать бюджет. Это часто омрачает подготовку,
          ведь ошибиться в выборе и испортить себе отдых не хочется никому. Блог
          поможет вам облегчить процесс – на сайте найдете всю необходимую
          информацию о культуре разных стран и прочих нюансах путешествий,
          основанную на личном опыте туристов.`
    },
    uk: {
      title: "Блог про подорожі: куди поїхати у відпустку",
      desc: "Дізнайтеся більше про культуру країни, яку ви мрієте відвідати",
      text1: `Подорожі – це не тільки відпочинок, а й розвиток. Побувавши в різних 
країнах, ви мимоволі навчаєте іноземну мову – удосконалюєте 
різні навички, дізнаєтеся про особливості народностей та розширюєте 
культурні уявлення про світ.`,
      text2: `Щоденник мандрівника – блог про подорожі. Часто люди губляться, плануючи 
свою відпустку, виникає багато запитань: куди їхати, який готель 
забронювати, як розрахувати бюджет Це часто затьмарює підготовку, 
адже помилитися у виборі та зіпсувати собі відпочинок не хочеться нікому. Блог 
допоможе вам полегшити процес - на сайті знайдете всю необхідну 
інформацію про культуру різних країн та інші нюанси подорожей, 
засновану на власному досвіді туристів.`
    }
  };

  const t = texts[lang];
  
  return (
    <section>
      <Container >
        <div className={css.wrapAbout}>
        <h1 className={css.aboutTitle}>
        {t.title}
        </h1>
        <p className={css.aboutTitleDesc}>
         {t.desc}
        </p>
        <p className={css.aboutText}>
        {t.text1}
        </p>
        <p className={css.aboutText}>
        {t.text2}
        </p>
        </div>
      </Container>
    </section>
  );
}
